tap "homebrew/bundle"
tap "homebrew/services"
tap "nikitabobko/tap" 

# Terminal
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "node"
brew "yarn"
brew "neovim"
brew "pandoc" # markup converter
brew "pandoc-crossref"
brew "weasyprint"
brew "libomp"
brew "lsd" # better ls
brew "fzf" # fuzzy finder
brew "ranger" # file browser

# DMBS
brew "postgresql@14"

# apps ===========================================================
cask "aldente"
cask "appcleaner"
cask "docker"
cask "font-fira-code"
cask "google-drive"
cask "hiddenbar"
cask "iina"
cask "karabiner-elements"
cask "keka"
cask "keyboardcleantool"
cask "mactex"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "miniconda"
cask "monitorcontrol"
cask "notion"
cask "obsidian"
cask "omnidisksweeper"
cask "postman"
cask "raycast"
cask "rectangle"
cask "shottr"
cask "spotify"
cask "visual-studio-code"
cask "warp"
cask "zoom"

# others that aren't really necessary============================
# cask "aerospace"
# cask "adobe-creative-cloud"
# cask "eclipse-ide"
# cask "iterm2"
# cask "utm"
# cask "wireshark"
# cask "google-chrome"
# cask "chromedriver"
# cask "mono-mdk-for-visual-studio"
# cask "discord"
# brew "tcpdump"
# brew "git-lfs" # git large files

# vscode extensions =============================================
# vscode "alefragnani.project-manager"
# vscode "azemoh.one-monokai"
# vscode "batisteo.vscode-django"
# vscode "bierner.github-markdown-preview"
# vscode "bierner.markdown-checkbox"
# vscode "bierner.markdown-emoji"
# vscode "bierner.markdown-footnotes"
# vscode "bierner.markdown-mermaid"
# vscode "bierner.markdown-preview-github-styles"
# vscode "bierner.markdown-yaml-preamble"
# vscode "christian-kohler.npm-intellisense"
# vscode "donjayamanne.python-environment-manager"
# vscode "donjayamanne.python-extension-pack"
# vscode "esbenp.prettier-vscode"
# vscode "fabiospampinato.vscode-monokai-night"
# vscode "formulahendry.code-runner"
# vscode "github.codespaces"
# vscode "github.copilot"
# vscode "github.copilot-chat"
# vscode "github.vscode-github-actions"
# vscode "github.vscode-pull-request-github"
# vscode "gruntfuggly.todo-tree"
# vscode "ikuyadeu.r-pack"
# vscode "inferrinizzard.prettier-sql-vscode"
# vscode "kevinrose.vsc-python-indent"
# vscode "mechatroner.rainbow-csv"
# vscode "mhutchie.git-graph"
# vscode "ms-azuretools.vscode-docker"
# vscode "ms-python.autopep8"
# vscode "ms-python.debugpy"
# vscode "ms-python.python"
# vscode "ms-python.vscode-pylance"
# vscode "ms-toolsai.jupyter"
# vscode "ms-toolsai.jupyter-keymap"
# vscode "ms-toolsai.jupyter-renderers"
# vscode "ms-toolsai.vscode-jupyter-cell-tags"
# vscode "ms-toolsai.vscode-jupyter-slideshow"
# vscode "ms-vscode-remote.remote-containers"
# vscode "ms-vscode-remote.remote-ssh"
# vscode "ms-vscode-remote.remote-ssh-edit"
# vscode "ms-vscode-remote.remote-wsl"
# vscode "ms-vscode-remote.vscode-remote-extensionpack"
# vscode "ms-vscode.cmake-tools"
# vscode "ms-vscode.cpptools"
# vscode "ms-vscode.cpptools-extension-pack"
# vscode "ms-vscode.cpptools-themes"
# vscode "ms-vscode.makefile-tools"
# vscode "ms-vscode.remote-explorer"
# vscode "ms-vscode.remote-server"
# vscode "ms-vsliveshare.vsliveshare"
# vscode "njpwerner.autodocstring"
# vscode "prisma.prisma"
# vscode "prisma.prisma-insider"
# vscode "rangav.vscode-thunder-client"
# vscode "redhat.java"
# vscode "redhat.vscode-xml"
# vscode "reditorsupport.r"
# vscode "ritwickdey.liveserver"
# vscode "rust-lang.rust-analyzer"
# vscode "sissel.shopify-liquid"
# vscode "tamasfe.even-better-toml"
# vscode "tomoki1207.pdf"
# vscode "twxs.cmake"
# vscode "usernamehw.errorlens"
# vscode "vadimcn.vscode-lldb"
# vscode "visualstudioexptteam.intellicode-api-usage-examples"
# vscode "visualstudioexptteam.vscodeintellicode"
# vscode "vscjava.vscode-gradle"
# vscode "vscjava.vscode-java-debug"
# vscode "vscjava.vscode-java-dependency"
# vscode "vscjava.vscode-java-pack"
# vscode "vscjava.vscode-java-test"
# vscode "vscjava.vscode-maven"
# vscode "vscjava.vscode-spring-initializr"
# vscode "vue.volar"
# vscode "wholroyd.jinja"
# vscode "yzane.markdown-pdf"
# vscode "yzhang.markdown-all-in-one"
