tap "homebrew/bundle"
tap "homebrew/services"
tap "localstack/tap"
tap "nikitabobko/tap"
tap "pantsbuild/tap"
brew "openssl@3"
brew "readline"
brew "sqlite"
brew "xz"
brew "awscli"
brew "bat"
brew "cloudflared"
brew "cocoapods"
brew "fzf"
brew "gdbm"
brew "git-filter-repo"
brew "git-lfs"
brew "jq"
brew "libomp"
brew "lsd"
brew "zlib"
brew "mysql"
brew "mysql-client@8.0"
brew "neovim"
brew "node"
brew "pandoc"
brew "pandoc-crossref"
brew "postgresql@14"
brew "pyenv"
brew "ranger"
brew "rbenv"
brew "redis"
brew "rust"
brew "tcl-tk"
brew "tcpdump"
brew "terraform"
brew "tmux"
brew "tree"
brew "typst"
brew "watchman"
brew "weasyprint"
brew "wget"
brew "yarn"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "adobe-creative-cloud"
cask "aerospace"
cask "aldente"
cask "android-studio"
cask "appcleaner"
cask "chromedriver"
cask "cursor"
cask "datagrip"
cask "discord"
cask "font-fira-code"
cask "google-chrome"
cask "google-drive"
cask "hiddenbar"
cask "iina"
cask "iterm2"
cask "karabiner-elements"
cask "keka"
cask "keyboardcleantool"
cask "mactex"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "microsoft-word"
cask "miniconda"
cask "monitorcontrol"
cask "mono-mdk-for-visual-studio"
cask "ngrok"
cask "nordvpn"
cask "notion"
cask "obsidian"
cask "omnidisksweeper"
cask "orbstack"
cask "pants"
cask "postman"
cask "raycast"
cask "rectangle"
cask "rocket"
cask "shottr"
cask "sketch"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "visual-studio-code"
cask "warp"
cask "wireshark-app"
cask "zoom"
cask "zulu@17"
vscode "alefragnani.project-manager"
vscode "azemoh.one-monokai"
vscode "batisteo.vscode-django"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-monokai-night"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "ikuyadeu.r-pack"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "kevinrose.vsc-python-indent"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "myriad-dreamin.tinymist"
vscode "njpwerner.autodocstring"
vscode "prisma.prisma"
vscode "prisma.prisma-insider"
vscode "rangav.vscode-thunder-client"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redis.redis-for-vscode"
vscode "reditorsupport.r"
vscode "reditorsupport.r-syntax"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "simonsiefke.svg-preview"
vscode "sissel.shopify-liquid"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-initializr"
vscode "vue.volar"
vscode "wholroyd.jinja"
vscode "yoavbls.pretty-ts-errors"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
